controllers/SearcherController.php

    public function actionCreate()
    {
        $this->layout = 'guest';
        $model = new Searcher();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `searcher` (`name`, `tg`, `call`, `phone`, `auto_number`, `address`, `coordinate`, `spg`, `sg`, `target_urban`, `target_forest`, `equipment`, `medicine_base`, `medicine_spec`, `created_at`) VALUES ('Калентьев Леонид', 'leonid_ka', NULL, '79613603024', 'e3343', 'г. Октябрьскй, ул. Ленина, д1', NULL, 1, 0, 0, 1, 'Квадрокоптер', 1, 0, 1770101374)

    protected function findModel($id)
    {
        if (($model = Searcher::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `searcher` WHERE `id`='2'