models/User.php

    public static function findByPhone($phone)
    {
        return static::findOne(['phone' => $phone, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`phone`='79613603024') AND (`status`=10)